Конфигурация/src/Documents/ПосещениеЗанятия/ПосещениеЗанятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПосещениеЗанятия</name>
  <registerRecords>AccumulationRegister.ПосещаемостьСтудентов</registerRecords>
  <registerRecords>AccumulationRegister.УспеваемостьСтудентов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Занятие</name>
    <type>
      <types>DocumentRef.Занятие</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗанятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Посещаемость</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПосещения</name>
      <type>
        <types>EnumRef.ВидыПосещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтсутствия</name>
      <type>
        <types>CatalogRef.ПричиныОтсутствия</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/ПосещаемостьСтудентов/ПосещаемостьСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПосещаемостьСтудентов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтсутствия</name>
    <type>
      <types>CatalogRef.ПричиныОтсутствия</types>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПосещения</name>
    <type>
      <types>EnumRef.ВидыПосещения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Documents/ПосещениеЗанятия/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПериодДвижения = ?(ЗначениеЗаполнено(ДатаЗанятия), ДатаЗанятия, Дата);

	Движения.ПосещаемостьСтудентов.Записывать = Истина;

	Для Каждого СтрокаПосещаемости Из Посещаемость Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаПосещаемости.Студент) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаПосещаемости.ВидПосещения) Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.ПосещаемостьСтудентов.Добавить();
		Движение.Период = ПериодДвижения;
		Движение.Студент = СтрокаПосещаемости.Студент;
		Движение.УчебнаяГруппа = УчебнаяГруппа;
		Движение.Дисциплина = Дисциплина;
		Движение.ВидПосещения = СтрокаПосещаемости.ВидПосещения;
		Движение.Количество = 1;
		Движение.УчебныйПериод = УчебныйПериод;
		Движение.Преподаватель = Преподаватель;
		Движение.ПричинаОтсутствия = СтрокаПосещаемости.ПричинаОтсутствия;

	КонецЦикла;

КонецПроцедуры
